// Generated by jextract

package com.loadingbyte.cinecred.natives.zimg;

import java.lang.invoke.MethodHandle;
import java.lang.invoke.VarHandle;
import java.nio.ByteOrder;
import java.lang.foreign.*;
import static java.lang.foreign.ValueLayout.*;
final class constants$0 {

    // Suppresses default constructor, ensuring non-instantiability.
    private constants$0() {}
    static final StructLayout const$0 = MemoryLayout.structLayout(
        JAVA_LONG.withName("__clang_max_align_nonce1"),
        MemoryLayout.paddingLayout(8),
        MemoryLayout.paddingLayout(16).withName("__clang_max_align_nonce2")
    ).withName("");
    static final VarHandle const$1 = constants$0.const$0.varHandle(MemoryLayout.PathElement.groupElement("__clang_max_align_nonce1"));
    static final FunctionDescriptor const$2 = FunctionDescriptor.ofVoid(
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$3 = RuntimeHelper.downcallHandle(
        "zimg_get_version_info",
        constants$0.const$2
    );
    static final FunctionDescriptor const$4 = FunctionDescriptor.of(JAVA_INT,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$5 = RuntimeHelper.downcallHandle(
        "zimg_get_api_version",
        constants$0.const$4
    );
    static final FunctionDescriptor const$6 = FunctionDescriptor.of(JAVA_INT,
        RuntimeHelper.POINTER,
        JAVA_LONG
    );
    static final MethodHandle const$7 = RuntimeHelper.downcallHandle(
        "zimg_get_last_error",
        constants$0.const$6
    );
    static final FunctionDescriptor const$8 = FunctionDescriptor.ofVoid();
    static final MethodHandle const$9 = RuntimeHelper.downcallHandle(
        "zimg_clear_last_error",
        constants$0.const$8
    );
    static final StructLayout const$10 = MemoryLayout.structLayout(
        JAVA_INT.withName("version"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.sequenceLayout(4, MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("data"),
            JAVA_LONG.withName("stride"),
            JAVA_INT.withName("mask"),
            MemoryLayout.paddingLayout(4)
        ).withName("")).withName("plane")
    ).withName("zimg_image_buffer_const");
    static final VarHandle const$11 = constants$0.const$10.varHandle(MemoryLayout.PathElement.groupElement("version"));
    static final StructLayout const$12 = MemoryLayout.structLayout(
        JAVA_INT.withName("version"),
        MemoryLayout.paddingLayout(4),
        MemoryLayout.sequenceLayout(4, MemoryLayout.structLayout(
            RuntimeHelper.POINTER.withName("data"),
            JAVA_LONG.withName("stride"),
            JAVA_INT.withName("mask"),
            MemoryLayout.paddingLayout(4)
        ).withName("")).withName("plane")
    ).withName("zimg_image_buffer");
    static final VarHandle const$13 = constants$0.const$12.varHandle(MemoryLayout.PathElement.groupElement("version"));
    static final FunctionDescriptor const$14 = FunctionDescriptor.of(JAVA_INT,
        JAVA_INT
    );
    static final MethodHandle const$15 = RuntimeHelper.downcallHandle(
        "zimg_select_buffer_mask",
        constants$0.const$14
    );
    static final FunctionDescriptor const$16 = FunctionDescriptor.of(JAVA_INT,
        RuntimeHelper.POINTER,
        JAVA_INT,
        JAVA_INT,
        JAVA_INT
    );
    static final MethodHandle const$17 = RuntimeHelper.upcallHandle(zimg_filter_graph_callback.class, "apply", constants$0.const$16);
    static final MethodHandle const$18 = RuntimeHelper.downcallHandle(
        constants$0.const$16
    );
    static final FunctionDescriptor const$19 = FunctionDescriptor.ofVoid(
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$20 = RuntimeHelper.downcallHandle(
        "zimg_filter_graph_free",
        constants$0.const$19
    );
    static final MethodHandle const$21 = RuntimeHelper.downcallHandle(
        "zimg_filter_graph_get_tmp_size",
        constants$0.const$4
    );
    static final MethodHandle const$22 = RuntimeHelper.downcallHandle(
        "zimg_filter_graph_get_input_buffering",
        constants$0.const$4
    );
    static final MethodHandle const$23 = RuntimeHelper.downcallHandle(
        "zimg_filter_graph_get_output_buffering",
        constants$0.const$4
    );
    static final FunctionDescriptor const$24 = FunctionDescriptor.of(JAVA_INT,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$25 = RuntimeHelper.downcallHandle(
        "zimg_filter_graph_process",
        constants$0.const$24
    );
    static final StructLayout const$26 = MemoryLayout.structLayout(
        JAVA_INT.withName("version"),
        JAVA_INT.withName("width"),
        JAVA_INT.withName("height"),
        JAVA_INT.withName("pixel_type"),
        JAVA_INT.withName("subsample_w"),
        JAVA_INT.withName("subsample_h"),
        JAVA_INT.withName("color_family"),
        JAVA_INT.withName("matrix_coefficients"),
        JAVA_INT.withName("transfer_characteristics"),
        JAVA_INT.withName("color_primaries"),
        JAVA_INT.withName("depth"),
        JAVA_INT.withName("pixel_range"),
        JAVA_INT.withName("field_parity"),
        JAVA_INT.withName("chroma_location"),
        MemoryLayout.structLayout(
            JAVA_DOUBLE.withName("left"),
            JAVA_DOUBLE.withName("top"),
            JAVA_DOUBLE.withName("width"),
            JAVA_DOUBLE.withName("height")
        ).withName("active_region"),
        JAVA_INT.withName("alpha"),
        MemoryLayout.paddingLayout(4)
    ).withName("zimg_image_format");
    static final VarHandle const$27 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("version"));
    static final VarHandle const$28 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("width"));
    static final VarHandle const$29 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("height"));
    static final VarHandle const$30 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("pixel_type"));
    static final VarHandle const$31 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("subsample_w"));
    static final VarHandle const$32 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("subsample_h"));
    static final VarHandle const$33 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("color_family"));
    static final VarHandle const$34 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("matrix_coefficients"));
    static final VarHandle const$35 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("transfer_characteristics"));
    static final VarHandle const$36 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("color_primaries"));
    static final VarHandle const$37 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("depth"));
    static final VarHandle const$38 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("pixel_range"));
    static final VarHandle const$39 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("field_parity"));
    static final VarHandle const$40 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("chroma_location"));
    static final StructLayout const$41 = MemoryLayout.structLayout(
        JAVA_DOUBLE.withName("left"),
        JAVA_DOUBLE.withName("top"),
        JAVA_DOUBLE.withName("width"),
        JAVA_DOUBLE.withName("height")
    ).withName("");
    static final VarHandle const$42 = constants$0.const$41.varHandle(MemoryLayout.PathElement.groupElement("left"));
    static final VarHandle const$43 = constants$0.const$41.varHandle(MemoryLayout.PathElement.groupElement("top"));
    static final VarHandle const$44 = constants$0.const$41.varHandle(MemoryLayout.PathElement.groupElement("width"));
    static final VarHandle const$45 = constants$0.const$41.varHandle(MemoryLayout.PathElement.groupElement("height"));
    static final VarHandle const$46 = constants$0.const$26.varHandle(MemoryLayout.PathElement.groupElement("alpha"));
    static final StructLayout const$47 = MemoryLayout.structLayout(
        JAVA_INT.withName("version"),
        JAVA_INT.withName("resample_filter"),
        JAVA_DOUBLE.withName("filter_param_a"),
        JAVA_DOUBLE.withName("filter_param_b"),
        JAVA_INT.withName("resample_filter_uv"),
        MemoryLayout.paddingLayout(4),
        JAVA_DOUBLE.withName("filter_param_a_uv"),
        JAVA_DOUBLE.withName("filter_param_b_uv"),
        JAVA_INT.withName("dither_type"),
        JAVA_INT.withName("cpu_type"),
        JAVA_DOUBLE.withName("nominal_peak_luminance"),
        JAVA_BYTE.withName("allow_approximate_gamma"),
        MemoryLayout.paddingLayout(7)
    ).withName("zimg_graph_builder_params");
    static final VarHandle const$48 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("version"));
    static final VarHandle const$49 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("resample_filter"));
    static final VarHandle const$50 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("filter_param_a"));
    static final VarHandle const$51 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("filter_param_b"));
    static final VarHandle const$52 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("resample_filter_uv"));
    static final VarHandle const$53 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("filter_param_a_uv"));
    static final VarHandle const$54 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("filter_param_b_uv"));
    static final VarHandle const$55 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("dither_type"));
    static final VarHandle const$56 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("cpu_type"));
    static final VarHandle const$57 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("nominal_peak_luminance"));
    static final VarHandle const$58 = constants$0.const$47.varHandle(MemoryLayout.PathElement.groupElement("allow_approximate_gamma"));
    static final FunctionDescriptor const$59 = FunctionDescriptor.ofVoid(
        RuntimeHelper.POINTER,
        JAVA_INT
    );
    static final MethodHandle const$60 = RuntimeHelper.downcallHandle(
        "zimg_image_format_default",
        constants$0.const$59
    );
    static final MethodHandle const$61 = RuntimeHelper.downcallHandle(
        "zimg_graph_builder_params_default",
        constants$0.const$59
    );
    static final FunctionDescriptor const$62 = FunctionDescriptor.of(RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER,
        RuntimeHelper.POINTER
    );
    static final MethodHandle const$63 = RuntimeHelper.downcallHandle(
        "zimg_filter_graph_build",
        constants$0.const$62
    );
    static final MemorySegment const$64 = MemorySegment.ofAddress(0L);
}


